cases/STM-2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linearUpwind grad(U);

    turbulence          Gauss linearUpwind limited;
    div(phi,epsilon)    $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,k)          $turbulence;

    div(phiWf,driftDensity)             Gauss linearUpwind grad(T);
    div(phi,driftDensity)               Gauss linearUpwind grad(T);

    div((nuEff*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             uncorrected;
}

wallDist
{
    method              meshWave;
}


// ************************************************************************* //
